package ru.warpreaktor.multithreading.syncronized;

public class BaeldungSynchronizedMethods {

    private int sum = 0;

    /**
     * В многопоточном коде этот метод вызванный 1000 раз в итоге получит сумму не равную 1000.
     * Однако ключевое слово synchronized поможет исправить эту проблему заставив все потоки выполнять этот метод
     * по очереди.
     *
     * Статические методы синхронизируются так же, как и методы экземпляра.
     * Эти методы синхронизируются с объектом класса , связанным с классом.
     * Поскольку для каждой JVM существует только один объект Class,
     * только один поток может выполняться внутри статического синхронизированного метода для каждого класса,
     * независимо от количества экземпляров, которые он имеет.
     */
    public synchronized void calculate() {
        setSum(getSum() + 1);
    }

    public int getSum() {
        return sum;
    }

    public void setSum(int sum) {
        this.sum = sum;
    }
}